Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_usart1.h
#define USART1_BRR_BRR                      (0xFFFFU<<0U)
#define USART1_BRR_BRR_0                    (0x1U<<0U)

// GTPR Configuration

#define USART1_GTPR_GT                      (0xFFU<<8U)
#define USART1_GTPR_GT_0                    (0x1U<<8U)
#define USART1_GTPR_PSC                     (0xFFU<<0U)
#define USART1_GTPR_PSC_0                   (0x1U<<0U)
#define USART1_GTPR_PSC_B_0X0               (0x0U<<0U)
#define USART1_GTPR_PSC_B_0X1               (0x1U<<0U)
#define USART1_GTPR_PSC_B_0X2               (0x2U<<0U)
#define USART1_GTPR_PSC_B_0X3               (0x3U<<0U)
#define USART1_GTPR_PSC_B_0X1F              (0x1FU<<0U)
#define USART1_GTPR_PSC_B_0X20              (0x20U<<0U)
#define USART1_GTPR_PSC_B_0XFF              (0xFFU<<0U)

// RTOR Configuration

#define USART1_RTOR_BLEN                    (0xFFU<<24U)
#define USART1_RTOR_BLEN_0                  (0x1U<<24U)
#define USART1_RTOR_RTO                     (0xFFFFFFU<<0U)
#define USART1_RTOR_RTO_0                   (0x1U<<0U)

// RQR Configuration

#define USART1_RQR_TXFRQ                    (0x1U<<4U)
#define USART1_RQR_RXFRQ                    (0x1U<<3U)
#define USART1_RQR_MMRQ                     (0x1U<<2U)
#define USART1_RQR_SBKRQ                    (0x1U<<1U)
#define USART1_RQR_ABRRQ                    (0x1U<<0U)

// ISR Configuration

#define USART1_ISR_TXFT                     (0x1U<<27U)
#define USART1_ISR_RXFT                     (0x1U<<26U)
#define USART1_ISR_TCBGT                    (0x1U<<25U)
#define USART1_ISR_RXFF                     (0x1U<<24U)
#define USART1_ISR_TXFE                     (0x1U<<23U)
#define USART1_ISR_REACK                    (0x1U<<22U)
#define USART1_ISR_TEACK                    (0x1U<<21U)
#define USART1_ISR_WUF                      (0x1U<<20U)
#define USART1_ISR_RWU                      (0x1U<<19U)
#define USART1_ISR_SBKF                     (0x1U<<18U)
#define USART1_ISR_CMF                      (0x1U<<17U)
#define USART1_ISR_BUSY                     (0x1U<<16U)
#define USART1_ISR_ABRF                     (0x1U<<15U)
#define USART1_ISR_ABRE                     (0x1U<<14U)
#define USART1_ISR_UDR                      (0x1U<<13U)
#define USART1_ISR_EOBF                     (0x1U<<12U)
#define USART1_ISR_RTOF                     (0x1U<<11U)
#define USART1_ISR_CTS                      (0x1U<<10U)
#define USART1_ISR_CTSIF                    (0x1U<<9U)
#define USART1_ISR_LBDF                     (0x1U<<8U)
#define USART1_ISR_TXFNF                    (0x1U<<7U)
#define USART1_ISR_TC                       (0x1U<<6U)
#define USART1_ISR_RXFNE                    (0x1U<<5U)
#define USART1_ISR_IDLE                     (0x1U<<4U)
#define USART1_ISR_ORE                      (0x1U<<3U)
#define USART1_ISR_NE                       (0x1U<<2U)
#define USART1_ISR_FE                       (0x1U<<1U)
#define USART1_ISR_PE                       (0x1U<<0U)
#define USART1_ISR_TXFT_B_0X0               (0x0U<<27U)
#define USART1_ISR_TXFT_B_0X1               (0x1U<<27U)
#define USART1_ISR_RXFT_B_0X0               (0x0U<<26U)
#define USART1_ISR_RXFT_B_0X1               (0x1U<<26U)
#define USART1_ISR_TCBGT_B_0X0              (0x0U<<25U)
#define USART1_ISR_TCBGT_B_0X1              (0x1U<<25U)
#define USART1_ISR_RXFF_B_0X0               (0x0U<<24U)
#define USART1_ISR_RXFF_B_0X1               (0x1U<<24U)
#define USART1_ISR_TXFE_B_0X0               (0x0U<<23U)
#define USART1_ISR_TXFE_B_0X1               (0x1U<<23U)
#define USART1_ISR_RWU_B_0X0                (0x0U<<19U)
#define USART1_ISR_RWU_B_0X1                (0x1U<<19U)
#define USART1_ISR_SBKF_B_0X0               (0x0U<<18U)
#define USART1_ISR_SBKF_B_0X1               (0x1U<<18U)
#define USART1_ISR_CMF_B_0X0                (0x0U<<17U)
#define USART1_ISR_CMF_B_0X1                (0x1U<<17U)
#define USART1_ISR_BUSY_B_0X0               (0x0U<<16U)
#define USART1_ISR_BUSY_B_0X1               (0x1U<<16U)
#define USART1_ISR_UDR_B_0X0                (0x0U<<13U)
#define USART1_ISR_UDR_B_0X1                (0x1U<<13U)
#define USART1_ISR_EOBF_B_0X0               (0x0U<<12U)
#define USART1_ISR_EOBF_B_0X1               (0x1U<<12U)
#define USART1_ISR_RTOF_B_0X0               (0x0U<<11U)
#define USART1_ISR_RTOF_B_0X1               (0x1U<<11U)
#define USART1_ISR_CTS_B_0X0                (0x0U<<10U)
#define USART1_ISR_CTS_B_0X1                (0x1U<<10U)
#define USART1_ISR_CTSIF_B_0X0              (0x0U<<9U)
#define USART1_ISR_CTSIF_B_0X1              (0x1U<<9U)
#define USART1_ISR_LBDF_B_0X0               (0x0U<<8U)
#define USART1_ISR_LBDF_B_0X1               (0x1U<<8U)
#define USART1_ISR_TXFNF_B_0X0              (0x0U<<7U)
#define USART1_ISR_TXFNF_B_0X1              (0x1U<<7U)
#define USART1_ISR_TC_B_0X0                 (0x0U<<6U)
#define USART1_ISR_TC_B_0X1                 (0x1U<<6U)
#define USART1_ISR_RXFNE_B_0X0              (0x0U<<5U)
#define USART1_ISR_RXFNE_B_0X1              (0x1U<<5U)
#define USART1_ISR_IDLE_B_0X0               (0x0U<<4U)
#define USART1_ISR_IDLE_B_0X1               (0x1U<<4U)
#define USART1_ISR_ORE_B_0X0                (0x0U<<3U)
#define USART1_ISR_ORE_B_0X1                (0x1U<<3U)
#define USART1_ISR_NE_B_0X0                 (0x0U<<2U)
#define USART1_ISR_NE_B_0X1                 (0x1U<<2U)
#define USART1_ISR_FE_B_0X0                 (0x0U<<1U)
#define USART1_ISR_FE_B_0X1                 (0x1U<<1U)
#define USART1_ISR_PE_B_0X0                 (0x0U<<0U)
#define USART1_ISR_PE_B_0X1                 (0x1U<<0U)

// ISR_ALTERNATE Configuration

#define USART1_ISR_ALTERNATE_TCBGT          (0x1U<<25U)
#define USART1_ISR_ALTERNATE_REACK          (0x1U<<22U)
#define USART1_ISR_ALTERNATE_TEACK          (0x1U<<21U)
#define USART1_ISR_ALTERNATE_WUF            (0x1U<<20U)
#define USART1_ISR_ALTERNATE_RWU            (0x1U<<19U)
#define USART1_ISR_ALTERNATE_SBKF           (0x1U<<18U)
#define USART1_ISR_ALTERNATE_CMF            (0x1U<<17U)
#define USART1_ISR_ALTERNATE_BUSY           (0x1U<<16U)
#define USART1_ISR_ALTERNATE_ABRF           (0x1U<<15U)
#define USART1_ISR_ALTERNATE_ABRE           (0x1U<<14U)
#define USART1_ISR_ALTERNATE_UDR            (0x1U<<13U)
#define USART1_ISR_ALTERNATE_EOBF           (0x1U<<12U)
#define USART1_ISR_ALTERNATE_RTOF           (0x1U<<11U)
#define USART1_ISR_ALTERNATE_CTS            (0x1U<<10U)
#define USART1_ISR_ALTERNATE_CTSIF          (0x1U<<9U)
#define USART1_ISR_ALTERNATE_LBDF           (0x1U<<8U)
#define USART1_ISR_ALTERNATE_TXE            (0x1U<<7U)
#define USART1_ISR_ALTERNATE_TC             (0x1U<<6U)
#define USART1_ISR_ALTERNATE_RXNE           (0x1U<<5U)
#define USART1_ISR_ALTERNATE_IDLE           (0x1U<<4U)
#define USART1_ISR_ALTERNATE_ORE            (0x1U<<3U)
#define USART1_ISR_ALTERNATE_NE             (0x1U<<2U)
#define USART1_ISR_ALTERNATE_FE             (0x1U<<1U)
#define USART1_ISR_ALTERNATE_PE             (0x1U<<0U)
#define USART1_ISR_ALTERNATE_TCBGT_B_0X0    (0x0U<<25U)
#define USART1_ISR_ALTERNATE_TCBGT_B_0X1    (0x1U<<25U)
#define USART1_ISR_ALTERNATE_RWU_B_0X0      (0x0U<<19U)
#define USART1_ISR_ALTERNATE_RWU_B_0X1      (0x1U<<19U)
#define USART1_ISR_ALTERNATE_SBKF_B_0X0     (0x0U<<18U)
#define USART1_ISR_ALTERNATE_SBKF_B_0X1     (0x1U<<18U)
#define USART1_ISR_ALTERNATE_CMF_B_0X0      (0x0U<<17U)
#define USART1_ISR_ALTERNATE_CMF_B_0X1      (0x1U<<17U)
#define USART1_ISR_ALTERNATE_BUSY_B_0X0     (0x0U<<16U)
#define USART1_ISR_ALTERNATE_BUSY_B_0X1     (0x1U<<16U)
#define USART1_ISR_ALTERNATE_UDR_B_0X0      (0x0U<<13U)
#define USART1_ISR_ALTERNATE_UDR_B_0X1      (0x1U<<13U)
#define USART1_ISR_ALTERNATE_EOBF_B_0X0     (0x0U<<12U)
#define USART1_ISR_ALTERNATE_EOBF_B_0X1     (0x1U<<12U)
#define USART1_ISR_ALTERNATE_RTOF_B_0X0     (0x0U<<11U)
#define USART1_ISR_ALTERNATE_RTOF_B_0X1     (0x1U<<11U)
#define USART1_ISR_ALTERNATE_CTS_B_0X0      (0x0U<<10U)
#define USART1_ISR_ALTERNATE_CTS_B_0X1      (0x1U<<10U)
#define USART1_ISR_ALTERNATE_CTSIF_B_0X0    (0x0U<<9U)
#define USART1_ISR_ALTERNATE_CTSIF_B_0X1    (0x1U<<9U)
#define USART1_ISR_ALTERNATE_LBDF_B_0X0     (0x0U<<8U)
#define USART1_ISR_ALTERNATE_LBDF_B_0X1     (0x1U<<8U)
#define USART1_ISR_ALTERNATE_TXE_B_0X0      (0x0U<<7U)
#define USART1_ISR_ALTERNATE_TXE_B_0X1      (0x1U<<7U)
#define USART1_ISR_ALTERNATE_TC_B_0X0       (0x0U<<6U)
#define USART1_ISR_ALTERNATE_TC_B_0X1       (0x1U<<6U)
#define USART1_ISR_ALTERNATE_RXNE_B_0X0     (0x0U<<5U)
#define USART1_ISR_ALTERNATE_RXNE_B_0X1     (0x1U<<5U)
#define USART1_ISR_ALTERNATE_IDLE_B_0X0     (0x0U<<4U)
#define USART1_ISR_ALTERNATE_IDLE_B_0X1     (0x1U<<4U)
#define USART1_ISR_ALTERNATE_ORE_B_0X0      (0x0U<<3U)
#define USART1_ISR_ALTERNATE_ORE_B_0X1      (0x1U<<3U)
#define USART1_ISR_ALTERNATE_NE_B_0X0       (0x0U<<2U)
#define USART1_ISR_ALTERNATE_NE_B_0X1       (0x1U<<2U)
#define USART1_ISR_ALTERNATE_FE_B_0X0       (0x0U<<1U)
#define USART1_ISR_ALTERNATE_FE_B_0X1       (0x1U<<1U)
#define USART1_ISR_ALTERNATE_PE_B_0X0       (0x0U<<0U)
#define USART1_ISR_ALTERNATE_PE_B_0X1       (0x1U<<0U)

// ICR Configuration

#define USART1_ICR_WUCF                     (0x1U<<20U)
#define USART1_ICR_CMCF                     (0x1U<<17U)
#define USART1_ICR_UDRCF                    (0x1U<<13U)
#define USART1_ICR_EOBCF                    (0x1U<<12U)
#define USART1_ICR_RTOCF                    (0x1U<<11U)
#define USART1_ICR_CTSCF                    (0x1U<<9U)
#define USART1_ICR_LBDCF                    (0x1U<<8U)
#define USART1_ICR_TCBGTCF                  (0x1U<<7U)
#define USART1_ICR_TCCF                     (0x1U<<6U)
#define USART1_ICR_TXFECF                   (0x1U<<5U)
#define USART1_ICR_IDLECF                   (0x1U<<4U)
#define USART1_ICR_ORECF                    (0x1U<<3U)
#define USART1_ICR_NECF                     (0x1U<<2U)
#define USART1_ICR_FECF                     (0x1U<<1U)
#define USART1_ICR_PECF                     (0x1U<<0U)

// RDR Configuration

#define USART1_RDR_RDR                      (0x1FFU<<0U)
#define USART1_RDR_RDR_0                    (0x1U<<0U)

// TDR Configuration

#define USART1_TDR_TDR                      (0x1FFU<<0U)
#define USART1_TDR_TDR_0                    (0x1U<<0U)

// PRESC Configuration

#define USART1_PRESC_PRESCALER              (0xFU<<0U)
#define USART1_PRESC_PRESCALER_0            (0x1U<<0U)
#define USART1_PRESC_PRESCALER_B_0X0        (0x0U<<0U)
#define USART1_PRESC_PRESCALER_B_0X1        (0x1U<<0U)
#define USART1_PRESC_PRESCALER_B_0X2        (0x2U<<0U)
#define USART1_PRESC_PRESCALER_B_0X3        (0x3U<<0U)
#define USART1_PRESC_PRESCALER_B_0X4        (0x4U<<0U)
#define USART1_PRESC_PRESCALER_B_0X5        (0x5U<<0U)
#define USART1_PRESC_PRESCALER_B_0X6        (0x6U<<0U)
#define USART1_PRESC_PRESCALER_B_0X7        (0x7U<<0U)
#define USART1_PRESC_PRESCALER_B_0X8        (0x8U<<0U)
#define USART1_PRESC_PRESCALER_B_0X9        (0x9U<<0U)
#define USART1_PRESC_PRESCALER_B_0XA        (0xAU<<0U)
#define USART1_PRESC_PRESCALER_B_0XB        (0xBU<<0U)
